accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/offers/GetApplicableBroadbandSpeed-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetApplicableBroadbandSpeeds">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetApplicableBroadbandSpeedsResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Zero or more repetitions:-->
               <get:ApplicableSpeeds>
                  <get:newSpeed>?</get:newSpeed>
                  <get:upgradeClass>?</get:upgradeClass>
                  <get:sequence>?</get:sequence>
                  <get:price>?</get:price>
               </get:ApplicableSpeeds>
            </lcew:Body>
         </Response>
      </web:GetApplicableBroadbandSpeedsResponse>
   </soapenv:Body>
</soapenv:Envelope>